// Напишите программу, которая принимает на вход трёхзначное число
// и на выходе показывает вторую цифру этого числа.
Console.Write("Введите трёхзначное число: ");
string s = Convert.ToString(Console.ReadLine());

Console.WriteLine(s[1]);



